export default function PrivacyPage() {
  return (
    <main className='p-10'>
      <h1 className='text-4xl font-bold mb-4'>隐私政策</h1>
      <p>欢迎来到 c9cu 的博客。</p>
      <p>
        c9cu
        的博客（简称“我们”）深知个人信息对您的重要性，我们将按照法律法规的规定，保护您的个人信息及隐私安全。我们致力于维持您对我们的信任，保护您的个人信息,本应用尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，本应用会按照本隐私权政策的规定使用和披露您的个人信息。但本应用将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本应用不会将这些信息对外披露或向第三方提供。本应用会不时更新本隐私权政策。
      </p>
      <p>
        您在同意本应用服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本应用服务使用协议不可分割的一部分。
      </p>
      <p>请在使用我们的产品（或服务）前，仔细阅读并了解本《隐私保护协议》。</p>
      <p>
        如果您不同意本隐私保护协议条款，我们无法为你提供完整的产品和服务，您也可以选择停止使用。当您选择继续或再次使用时，基于提供产品和服务所必需，将视为您接受和认可我们按照本协议条款对您的相关信息进行处理。
      </p>
      <h2 className='mt-4'>一、个人信息的收集和使用 个人信息的收集</h2>
      在您使用“c9cu的博客”软件及相关服务的过程中，我们将根据合法、正当、必要的原则，向您明示收集、使用的目的、方式和范围，进行信息收集。我们为了向所有用户提供更好的服务和更完善的功能，可能会收集、储存和使用与您有关的信息以保障产品的正常基础运行；同时在不断优化、改善产品和服务过程中；及保障产品、服务以及用户使用安全的情况下也可能收集、使用、存储您的相关信息。
      （1）您在使用服务时上传的信息 例如：您在评论时上传的头像及个人基本资料。
      （2）您通过我们的客服或参加我们举办的活动提交的信息
      例如：您参与我们线上活动提交的资料中包含的信息。
      若您主动提供个人信息，即表示您同意我们按本政策所述目的和方式来处理您的个人信息。您提供的上述信息，将在您使用本服务期间持续授权我们使用。在您注销账号时，我们将停止使用并删除上述信息。
      <h2 className='mt-4'>二、 我们在您使用服务时获取的信息</h2>
      (1)日志信息
      当您使用我们的服务时，我们可能会自动存储手机相关信息为服务日志信息:
      设备信息，例如，设备型号，操作系统版本等信息；软件信息，例如，软件的版本号；IP地址。
      (2) 从第三方合作伙伴获取的信息
      我们可能会获得您在使用第三方合作伙伴服务时所产生或分享的信息。例如您使用微信服务时，我们会获取您登录第三方合作伙伴服务的名称，登陆时间，方便您进行授权管理。请您仔细阅读第三方合作伙伴服务的用户协议或隐私政策。
      <h2 className='mt-4'>三、我们如何使用收集的信息</h2>
      我们严格遵守法律法规的规定及与用户的规定，将您的信息用于以下用途。若我们超出以下用途使用您的信息，我们将在此向您说明，并征得您的同意。
      （1）向您提供服务。
      （2）满足您的个性化需求。例如，语言设定，位置设定，个性化服务。
      为了让您有更好的体验，改善我们的服务或经您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某些服务所收集的信息用于我们的其他服务。
      为了确保服务的安全，帮助我们更好的了解我们应用程序的运行情况，我们可能会记录相关信息。例如您使用应用程序的频率、故障信息、总体使用情况、性能数据以及应用程序的来源。
      我们不会将我们存储在分析软件中的信息与您应用程序中提供的个人身份信息相结合。
      <h2 className='mt-4'>
        四、分享 未经您同意，我们不会与我们之外的任何第三方分享您的信息。
      </h2>
      您可以通过我们的服务与您的好友，家人及其他用户分享您的相关信息。例如，您在微信朋友圈中公开分享的文字和照片。请注意，这其中可能包含您的个人身份信息、个人财产信息等敏感信息。请您谨慎考虑披露您的相关个人敏感信息。
      <h2 className='mt-4'>五、披露</h2>
      我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会披露您的信息：
      1、根据您的需求，在您明确同意的披露方式下披露您所指定的信息；
      2、根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您信息的情况下，我们可能会依据所要求的信息类型和披露方式披露您的信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求接收方必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持透明。我们对所有的请求都进行了慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。
      <h2 className='mt-4'>六、个人信息的保护和安全措施</h2>
      （1）我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。
      （2）我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
      （3）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他我们用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。
      （4）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
      （5）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
      同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
      <h2 className='mt-4'>七、您的权利</h2>
      按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
      （1）访问您的个人信息
      您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：
      账户信息——如果您希望访问或编辑您的账户中的个人资料信息和支付信息、更改您的密码、添加安全信息或关闭您的账户等，您可以通过访问个人中心执行此类操作。
      如果您无法通过上述链接访问这些个人信息，您可以随时发送电子邮件至
      zhao172232502@gmail.com。我们将在15天内回复您的访问请求。
      对于您在使用我们的产品或服务过程中产生的其他个人信息，只要我们不需要过多投入，我们会向您提供。如果您想行使数据访问权，请发送电子邮件至
      zhao172232502@gmail.com。 （2）更正您的个人信息
      当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正。您可以通过“（一）访问您的个人信息”中罗列的方式提出更正申请。
      如果您无法通过上述链接更正这些个人信息，您可以随时发送电子邮件至
      zhao172232502@gmail.com。我们将在15天内回复您的更正请求。
      （3）删除您的个人信息 在以下情形中，您可以向我们提出删除个人信息的请求：
      1、如果我们处理个人信息的行为违反法律法规；
      2、如果我们收集、使用您的个人信息，却未征得您的同意；
      3、如果我们处理个人信息的行为违反了与您的约定；
      4、如果您不再使用我们的产品或服务； 5、如果我们不再为您提供产品或服务。
      若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
      当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
      <h2 className='mt-4'>八、我们如何处理儿童的个人信息</h2>
      我们的产品、网站和服务主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户账户。
      对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。
      尽管当地法律和习俗对儿童的定义不同，但我们将不满 14
      周岁的任何人均视为儿童。
      如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
      九、本隐私权政策如何更新
      为了给您提供更好的服务，我们及相关服务将不时更新与变化，我们会适时对本隐私政策进行修订，这些修订构成本隐私政策的一部分并具有等同于本隐私政策的效力，未经您明确同意，我们不会削减您依据当前生效的本隐私政策所应享受的权利。本隐私政策更新后，我们会在c9cu
      的博客出更新版本，并在更新后的条款生效前通过官方公告或其他适当的方式提醒您更新的内容，以便您及时了解本隐私政策的最新版本。
      <h2 className='mt-4'>十、如何联系我们</h2>
      如果您对本隐私政策有任何疑问、意见或建议及合作事宜，通过以下方式与我们联系：邮箱：
      zhao172232502@gmail.com，我们将尽快审核所涉问题，并在三十天内予以回复。
    </main>
  )
}
